case/outputs_mitigated/openfoam_cases/section_1_x1p1km/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 0 0 0 0 0];
internalField uniform 0;

boundaryField
{
    inlet   { type fixedValue; value uniform 0.31251; }
    outlet  { type inletOutlet; inletValue uniform 0; value uniform 0; }
    walls   { type zeroGradient; }
}
