case/outputs_mitigated/openfoam_cases/section_1_x1p1km/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];
internalField uniform 10.1589;

boundaryField
{
    inlet   { type fixedValue; value uniform 10.1589; }
    outlet  { type inletOutlet; inletValue uniform 10.1589; value uniform 10.1589; }
    walls   { type omegaWallFunction; value uniform 10.1589; }
}
